OpenEPaperLink/OpenEPaperLink/ARM_Tag_FW/cc2531_OEPL/contiki/sdcc/non-free/include/pic16/pic18f252.h
extern __at(0x0FFC) volatile __STKPTRbits_t STKPTRbits;

#define _STKPTR0                0x01
#define _SP0                    0x01
#define _STKPTR1                0x02
#define _SP1                    0x02
#define _STKPTR2                0x04
#define _SP2                    0x04
#define _STKPTR3                0x08
#define _SP3                    0x08
#define _STKPTR4                0x10
#define _SP4                    0x10
#define _STKUNF                 0x40
#define _STKFUL                 0x80
#define _STKOVF                 0x80

//==============================================================================

extern __at(0x0FFD) __sfr TOS;
extern __at(0x0FFD) __sfr TOSL;
extern __at(0x0FFE) __sfr TOSH;
extern __at(0x0FFF) __sfr TOSU;

//==============================================================================
//
//        Configuration Bits
//
//==============================================================================

#define __CONFIG1H              0x300001
#define __CONFIG2L              0x300002
#define __CONFIG2H              0x300003
#define __CONFIG3H              0x300005
#define __CONFIG4L              0x300006
#define __CONFIG5L              0x300008
#define __CONFIG5H              0x300009
#define __CONFIG6L              0x30000A
#define __CONFIG6H              0x30000B
#define __CONFIG7L              0x30000C
#define __CONFIG7H              0x30000D

//----------------------------- CONFIG1H Options -------------------------------

#define _LP_OSC                 0xF8    // LP oscillator.
#define _LP_OSC_1H              0xF8    // LP oscillator.
#define _XT_OSC                 0xF9    // XT oscillator.
#define _XT_OSC_1H              0xF9    // XT oscillator.
#define _HS_OSC                 0xFA    // HS oscillator.
#define _HS_OSC_1H              0xFA    // HS oscillator.
#define _RC_OSC                 0xFB    // RC oscillator.
#define _RC_OSC_1H              0xFB    // RC oscillator.
#define _EC_OSC                 0xFC    // EC oscillator w/ OSC2 configured as divide-by-4 clock output.
#define _EC_OSC_1H              0xFC    // EC oscillator w/ OSC2 configured as divide-by-4 clock output.
#define _ECIO_OSC               0xFD    // EC oscillator w/ OSC2 configured as RA6.
#define _ECIO_OSC_1H            0xFD    // EC oscillator w/ OSC2 configured as RA6.
#define _HSPLL_OSC              0xFE    // HS oscillator with PLL enabled/Clock frequency = (4 x FOSC).
#define _HSPLL_OSC_1H           0xFE    // HS oscillator with PLL enabled/Clock frequency = (4 x FOSC).
#define _RCIO_OSC               0xFF    // RC oscillator w/ OSC2 configured as RA6.
#define _RCIO_OSC_1H            0xFF    // RC oscillator w/ OSC2 configured as RA6.
#define _OSCS_ON_1H             0xDF    // Oscillator system clock switch option is enabled (oscillator switching is enabled).
#define _OSCS_OFF_1H            0xFF    // Oscillator system clock switch option is disabled (main oscillator is source).

//----------------------------- CONFIG2L Options -------------------------------

#define _PWRT_ON_2L             0xFE    // PWRT enabled.
#define _PWRT_OFF_2L            0xFF    // PWRT disabled.
#define _BOR_OFF_2L             0xFD    // Brown-out Reset disabled.
#define _BOR_ON_2L              0xFF    // Brown-out Reset enabled.
#define _BORV_45_2L             0xF3    // VBOR set to 4.5V.
#define _BORV_42_2L             0xF7    // VBOR set to 4.2V.
#define _BORV_27_2L             0xFB    // VBOR set to 2.7V.
#define _BORV_20                0xFF    // VBOR set to 2.0V.
#define _BORV_20_2L             0xFF    // VBOR set to 2.0V.

//----------------------------- CONFIG2H Options -------------------------------

#define _WDT_OFF_2H             0xFE    // WDT disabled (control is placed on the SWDTEN bit).
#define _WDT_ON_2H              0xFF    // WDT enabled.
#define _WDTPS_1_2H             0xF1    // 1:1.
#define _WDTPS_2_2H             0xF3    // 1:2.
#define _WDTPS_4_2H             0xF5    // 1:4.
#define _WDTPS_8_2H             0xF7    // 1:8.
#define _WDTPS_16_2H            0xF9    // 1:16.
#define _WDTPS_32_2H            0xFB    // 1:32.
#define _WDTPS_64_2H            0xFD    // 1:64.
#define _WDTPS_128_2H           0xFF    // 1:128.

//----------------------------- CONFIG3H Options -------------------------------

#define _CCP2MX_OFF             0xFE    // CCP2 input/output is multiplexed with RB3.
#define _CCP2MX_OFF_3H          0xFE    // CCP2 input/output is multiplexed with RB3.
#define _CCP2MX_ON              0xFF    // CCP2 input/output is multiplexed with RC1.
#define _CCP2MX_ON_3H           0xFF    // CCP2 input/output is multiplexed with RC1.

//----------------------------- CONFIG4L Options -------------------------------

#define _STVR_OFF_4L            0xFE    // Stack Full/Underflow will not cause RESET.
#define _STVR_ON_4L             0xFF    // Stack Full/Underflow will cause RESET.
#define _LVP_OFF_4L             0xFB    // Low Voltage ICSP disabled.
#define _LVP_ON_4L              0xFF    // Low Voltage ICSP enabled.
#define _DEBUG_ON_4L            0x7F    // Background Debugger enabled. RB6 and RB7 are dedicated to In-Circuit Debug.
#define _DEBUG_OFF_4L           0xFF    // Background Debugger disabled. RB6 and RB7 configured as general purpose I/O pins.

//----------------------------- CONFIG5L Options -------------------------------

#define _CP0_ON_5L              0xFE    // Block 0 (000200-001FFFh) code protected.
#define _CP0_OFF_5L             0xFF    // Block 0 (000200-001FFFh) not code protected.
#define _CP1_ON_5L              0xFD    // Block 1 (002000-003FFFh) code protected.
#define _CP1_OFF_5L             0xFF    // Block 1 (002000-003FFFh) not code protected.
#define _CP2_ON_5L              0xFB    // Block 2 (004000-005FFFh) code protected.
#define _CP2_OFF_5L             0xFF    // Block 2 (004000-005FFFh) not code protected.
#define _CP3_ON_5L              0xF7    // Block 3 (006000-007FFFh) code protected.
#define _CP3_OFF_5L             0xFF    // Block 3 (006000-007FFFh) not code protected.

